tutorials/laserbeamFoam/AutoCalibrateParameter/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  back
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }
  front
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }
  leftWall
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }
  rightWall
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }
  topWall
  {
    type            totalPressure;
    p0              uniform 0;
    U               U;
    phi             phi;
  }
  bottomWall
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }
  defaultFaces
  {
    type            empty;
  } 

}

// ************************************************************************* //
