tutorials/laserbeamFoam/AutoCalibrateParameter/system/bedPlateDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      bedPlateDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Bed true;

xmin 0.0;
xmax 0.0003;

ymin 0.0;
ymax 0.0008;

zmin 0.0;
zmax 0.0002;

// ************************************************************************* //
